app/Controllers/Academic/CourseController.php

 public function create()
{
    // Check admin authentication
    $authCheck = $this->checkAdminAuth();
    if ($authCheck !== true) {
        return $authCheck;
    }

    $courseModel = new \App\Models\Academic\CourseModel();

    $data = [
        'courses' => $courseModel->findAll() // form + list
    ];
---
SELECT *
FROM `courses`