app/Controllers/Academic/PaperController.php

public function create()

{

    // Check admin authentication

    $authCheck = $this->checkAdminAuth();

    if ($authCheck !== true) {

        return $authCheck;

    }



    $courseModel = new \App\Models\Academic\CourseModel();

    $paperModel  = new \App\Models\Academic\PaperModel();



    $data = [

        'courses' => $courseModel->findAll(),

        'papers'  => $paperModel->findAll(), // 👈 Add existing paper list
---
SELECT *
FROM `courses`
SELECT *
FROM `papers`