app/Controllers/Academic/StudentContentController.php

SELECT *
FROM `units`
SELECT *
FROM `papers`
SELECT *
FROM `courses`
---
    public function index()
{
    $courseModel = new \App\Models\Academic\CourseModel();
    $paperModel = new \App\Models\Academic\PaperModel();
    $unitModel = new \App\Models\Academic\UnitModel();
    $chapterModel = new \App\Models\Academic\ChapterModel();

    $data = [
        'courses' => $courseModel->findAll(),
        'papers' => $paperModel->findAll(),
        'units' => $unitModel->findAll(),
        'chapters' => $chapterModel->findAll(),
                // ✅ SEO DATA
        'meta_title' => 'Study Material (LMS) - Arun Computer College Rewa',
        'meta_description' => 'PGDCA, DCA, Tally and Programming study material for students of Arun Computer College Rewa.',
        'meta_url' => base_url('student-content')
    ];

SELECT *
FROM `chapters`
WHERE `slug` = 'modern-office-activities-eng-medium'
 LIMIT 1
---
    public function viewChapter($slug)
{
    $chapterModel = new ChapterModel();
    $chapter = $chapterModel->where('slug', $slug)->first();

    if (!$chapter) {
        throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Chapter not found");
    }

    $unitId = $chapter['unit_id'];
    $currentId = $chapter['id'];

    // Previous Chapter (same unit)
    $previous = $chapterModel
        ->where('unit_id', $unitId)
        ->where('id <', $currentId)
        ->orderBy('id', 'DESC')
        ->first();

    // Next Chapter (same unit)
    $next = $chapterModel
        ->where('unit_id', $unitId)
        ->where('id >', $currentId)
        ->orderBy('id', 'ASC')
        ->first();

    $courseModel = new CourseModel();
    $paperModel = new PaperModel();
    $unitModel = new UnitModel();

    $data = [
        'chapter' => $chapter,
        'previous' => $previous,
        'next' => $next,
        'courses' => $courseModel->findAll(),
        'papers' => $paperModel->findAll(),
        'units' => $unitModel->findAll(),
        'chapters' => $chapterModel->findAll(),
         // ✅ Dynamic SEO
        'meta_title' => $chapter['name'] . ' | Arun Computer College Rewa',
        'meta_description' => substr(strip_tags($chapter['content']), 0, 150),
        'meta_url' => current_url()

    ];