app/Controllers/Academic/UnitController.php

    public function edit($id)
    {
        // Check admin authentication
        $authCheck = $this->checkAdminAuth();
        if ($authCheck !== true) {
            return $authCheck;
        }

        $model = new UnitModel();
        $paperModel = new PaperModel();
        $data['unit'] = $model->find($id);
        $data['papers'] = $paperModel->findAll();
---
SELECT *
FROM `papers`