app/Views/pages/home.php


            $model = new NoticeModel();

            $notices = $model->where('status', 'active')->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `notices`
WHERE `status` = 'active'
ORDER BY `created_at` DESC