app/Models/Academic/UnitModel.php

   public function getChaptersWithHierarchy()
    {
        return $this->db->table('chapters')
            ->select('chapters.*, units.name as unit_title, papers.name as paper_title, courses.name as course_title')
            ->join('units', 'chapters.unit_id = units.id')
            ->join('papers', 'units.paper_id = papers.id')
            ->join('courses', 'papers.course_id = courses.id')
            ->get()
            ->getResult();
---
SELECT `units`.*, `papers`.`name` as `paper_title`, `courses`.`name` as `course_title`
FROM `units`
JOIN `papers` ON `units`.`paper_id` = `papers`.`id`
JOIN `courses` ON `papers`.`course_id` = `courses`.`id`