app/Controllers/AdmissionPage.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $courseModel     = new CourseModel();
        $data['courses'] = $courseModel->findAll();